//================================================================================================================
//
// DirectXの3Dモデル配置のcppファイル [3DModel.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "3DModel.h"
#include "modeldata.h"
#include "mathUtil.h"

using namespace MyMathUtil;

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************
#define MAX_3DMODEL		(256)			// 設置できるモデルの最大数

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
_3DMODEL g_aModel[MAX_3DMODEL];		// 3Dモデル情報
int g_nNumModel;					// 設置した3Dモデルの数

//=================================================================================================
// --- モデル初期化 ---
//=================================================================================================
void Init3DModel(void)
{
	// モデルを初期化
	ZeroMemory(&g_aModel[0], sizeof(_3DMODEL) * (MAX_3DMODEL));

	// 設置したモデルの数を初期化
	g_nNumModel = 0;
}

//=================================================================================================
// --- モデル終了 ---
//=================================================================================================
void Uninit3DModel(void)
{
	// 3Dmodel.cppにて動的にメモリを確保した場合(テクスチャ読み込み等)、ここで解放
}

//=================================================================================================
// --- モデル更新 ---
//=================================================================================================
void Update3DModel(void)
{
	
}

//=================================================================================================
// --- モデル描画 ---
//=================================================================================================
void Draw3DModel(void)
{
	// デバイスの取得開始
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	LP3DMODEL p3DModel = &g_aModel[0];	// 3Dモデルへのポインタ

	// 3Dモデルの描画
	for (int nCnt3DModel = 0; nCnt3DModel < MAX_3DMODEL; nCnt3DModel++, p3DModel++)
	{
		if (p3DModel->bUse != false)
		{ // もし使われていれば
			// マトリックスを計算
			CalcWorldMatrix(&p3DModel->mtxWorld,
				p3DModel->pos,
				p3DModel->rot);

			// モデルデータを取得
			LPMODELDATA pModelData = GetModelData(p3DModel->nIdx3Dmodel);
			Draw3DModelFromModelData(pDevice,
				pModelData,
				&p3DModel->mtxWorld,
				nullptr);
		}
	}

	// デバイスの取得終了
	EndDevice();
}

//=================================================================================================
// --- モデル設置 ---
//=================================================================================================
int Set3DModel(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nIdxModelData)
{
	LP3DMODEL p3DModel = &g_aModel[0];
	int nCnt3DModel;

	// 3Dモデルの設置
	for (nCnt3DModel = 0; nCnt3DModel < MAX_3DMODEL; nCnt3DModel++, p3DModel++)
	{
		if (p3DModel->bUse == false)
		{ // もし使われていなければ
			p3DModel->pos = pos;
			p3DModel->rot = rot;
			p3DModel->bUse = true;
			g_nNumModel++;

			break;
		}
	}

	// 最大数を超えていれば-1に変更
	if (nCnt3DModel >= MAX_3DMODEL) nCnt3DModel = -1;

	return nCnt3DModel;
}

//=================================================================================================
// --- ポインタ取得 ---
//=================================================================================================
LP3DMODEL Get3DModel(int nIdxModel)
{
	// もしインデックス外なら
	if (nIdxModel < 0 || nIdxModel >= MAX_3DMODEL) return NULL;
	return &g_aModel[nIdxModel];
}