//==================================================================================
//
// タイトル背景表示ヘッダファイル [BackGroundManager.h]
// Author : TENMA
//
//==================================================================================
#ifndef _BACKGROUNDMANAGER_H_
#define _BACKGROUNDMANAGER_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include "mode.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitBackGroundManager(void);
void UninitBackGroundManager(void);
void UpdateBackGroundManager(void);
void DrawBackGroundManager(void);

void SetBackGround(MODE bg);
void SetEnableBackGround(bool bEnable);
#endif
